rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FLEXPWM.h
/*
** ###################################################################
**     Processor:           S32K37_M7
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32K37 RM Rev.3
**     Version:             rev. 2.0, 2024-03-28
**     Build:               b240328
**
**     Abstract:
**         Peripheral Access Layer for S32K37_M7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K37_FLEXPWM.h
 * @version 2.0
 * @date 2024-03-28
 * @brief Peripheral Access Layer for S32K37_FLEXPWM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K37_FLEXPWM_H_)  /* Check if memory map has not been already included */
#define S32K37_FLEXPWM_H_

#include "S32K37_COMMON.h"

/* ----------------------------------------------------------------------------
   -- FLEXPWM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXPWM_Peripheral_Access_Layer FLEXPWM Peripheral Access Layer
 * @{
 */

/** FLEXPWM - Size of Registers Arrays */
#define FLEXPWM_SM_COUNT                          4u
#define FLEXPWM_FP_COUNT                          1u

/** FLEXPWM - Register Layout Typedef */
typedef struct {
  struct FLEXPWM_SM {                              /* offset: 0x0, array step: 0x60 */
    __I  uint16_t CNT;                               /**< Submodule 0 Counter..Submodule 3 Counter, array offset: 0x0, array step: 0x60 */
    __IO uint16_t INIT;                              /**< Submodule 0 Initial Count..Submodule 3 Initial Count, array offset: 0x2, array step: 0x60 */
    __IO uint16_t CTRL2;                             /**< Submodule 0 Control 2..Submodule 3 Control 2, array offset: 0x4, array step: 0x60 */
    __IO uint16_t CTRL;                              /**< Submodule 0 Control..Submodule 3 Control, array offset: 0x6, array step: 0x60 */
    uint8_t RESERVED_0[2];
    __IO uint16_t VAL0;                              /**< Submodule 0 Value 0..Submodule 3 Value 0, array offset: 0xA, array step: 0x60 */
    __IO uint16_t FRACVAL1;                          /**< Submodule 0 Fractional Value 1..Submodule 3 Fractional Value 1, array offset: 0xC, array step: 0x60 */
    __IO uint16_t VAL1;                              /**< Submodule 0 Value 1..Submodule 3 Value 1, array offset: 0xE, array step: 0x60 */
    __IO uint16_t FRACVAL2;                          /**< Submodule 0 Fractional Value 2..Submodule 3 Fractional Value 2, array offset: 0x10, array step: 0x60 */
    __IO uint16_t VAL2;                              /**< Submodule 0 Value 2..Submodule 3 Value 2, array offset: 0x12, array step: 0x60 */
    __IO uint16_t FRACVAL3;                          /**< Submodule 0 Fractional Value 3..Submodule 3 Fractional Value 3, array offset: 0x14, array step: 0x60 */
    __IO uint16_t VAL3;                              /**< Submodule 0 Value 3..Submodule 3 Value 3, array offset: 0x16, array step: 0x60 */
    __IO uint16_t FRACVAL4;                          /**< Submodule 0 Fractional Value 4..Submodule 3 Fractional Value 4, array offset: 0x18, array step: 0x60 */
    __IO uint16_t VAL4;                              /**< Submodule 0 Value 4..Submodule 3 Value 4, array offset: 0x1A, array step: 0x60 */
    __IO uint16_t FRACVAL5;                          /**< Submodule 0 Fractional Value 5..Submodule 3 Fractional Value 5, array offset: 0x1C, array step: 0x60 */
    __IO uint16_t VAL5;                              /**< Submodule 0 Value 5..Submodule 3 Value 5, array offset: 0x1E, array step: 0x60 */
    __IO uint16_t FRCTRL;                            /**< Submodule 0 Fractional Control..Submodule 3 Fractional Control, array offset: 0x20, array step: 0x60 */
    __IO uint16_t OCTRL;                             /**< Submodule 0 Output Control..Submodule 3 Output Control, array offset: 0x22, array step: 0x60 */
    __IO uint16_t STS;                               /**< Submodule 0 Status..Submodule 3 Status, array offset: 0x24, array step: 0x60 */
    __IO uint16_t INTEN;                             /**< Submodule 0 Interrupt Enable..Submodule 3 Interrupt Enable, array offset: 0x26, array step: 0x60 */
    __IO uint16_t DMAEN;                             /**< Submodule 0 DMA Enable..Submodule 3 DMA Enable, array offset: 0x28, array step: 0x60 */
    __IO uint16_t TCTRL;                             /**< Submodule 0 Output Trigger Control..Submodule 3 Output Trigger Control, array offset: 0x2A, array step: 0x60 */
    __IO uint16_t DISMAP0;                           /**< Submodule 0 Fault Disable Mapping..Submodule 3 Fault Disable Mapping, array offset: 0x2C, array step: 0x60 */
    __IO uint16_t DISMAP1;                           /**< Submodule 0 Fault Disable Mapping..Submodule 3 Fault Disable Mapping, array offset: 0x2E, array step: 0x60 */
    __IO uint16_t DTCNT0;                            /**< Submodule 0 Deadtime Count 0..Submodule 3 Deadtime Count 0, array offset: 0x30, array step: 0x60 */
    __IO uint16_t DTCNT1;                            /**< Submodule 0 Deadtime Count 1..Submodule 3 Deadtime Count 1, array offset: 0x32, array step: 0x60 */
    __IO uint16_t CAPTCTRLA;                         /**< Submodule 0 Capture Control A..Submodule 3 Capture Control A, array offset: 0x34, array step: 0x60 */
    __IO uint16_t CAPTCOMPA;                         /**< Submodule 0 Capture Compare A..Submodule 3 Capture Compare A, array offset: 0x36, array step: 0x60 */
    __IO uint16_t CAPTCTRLB;                         /**< Submodule 0 Capture Control B..Submodule 3 Capture Control B, array offset: 0x38, array step: 0x60 */
    __IO uint16_t CAPTCOMPB;                         /**< Submodule 0 Capture Compare B..Submodule 3 Capture Compare B, array offset: 0x3A, array step: 0x60 */
    __IO uint16_t CAPTCTRLX;                         /**< Submodule 0 Capture Control X..Submodule 3 Capture Control X, array offset: 0x3C, array step: 0x60 */
    __IO uint16_t CAPTCOMPX;                         /**< Submodule 0 Capture Compare X..Submodule 3 Capture Compare X, array offset: 0x3E, array step: 0x60 */
    __I  uint16_t CVAL0;                             /**< Submodule 0 Capture Value 0..Submodule 3 Capture Value 0, array offset: 0x40, array step: 0x60 */
    __I  uint16_t CVAL0CYC;                          /**< Submodule 0 Capture Value 0 Cycle..Submodule 3 Capture Value 0 Cycle, array offset: 0x42, array step: 0x60 */
    __I  uint16_t CVAL1;                             /**< Submodule 0 Capture Value 1..Submodule 3 Capture Value 1, array offset: 0x44, array step: 0x60 */
    __I  uint16_t CVAL1CYC;                          /**< Submodule 0 Capture Value 1 Cycle..Submodule 3 Capture Value 1 Cycle, array offset: 0x46, array step: 0x60 */
    __I  uint16_t CVAL2;                             /**< Submodule 0 Capture Value 2..Submodule 3 Capture Value 2, array offset: 0x48, array step: 0x60 */
    __I  uint16_t CVAL2CYC;                          /**< Submodule 0 Capture Value 2 Cycle..Submodule 3 Capture Value 2 Cycle, array offset: 0x4A, array step: 0x60 */
    __I  uint16_t CVAL3;                             /**< Submodule 0 Capture Value 3..Submodule 3 Capture Value 3, array offset: 0x4C, array step: 0x60 */
    __I  uint16_t CVAL3CYC;                          /**< Submodule 0 Capture Value 3 Cycle..Submodule 3 Capture Value 3 Cycle, array offset: 0x4E, array step: 0x60 */
    __I  uint16_t CVAL4;                             /**< Submodule 0 Capture Value 4..Submodule 3 Capture Value 4, array offset: 0x50, array step: 0x60 */
    __I  uint16_t CVAL4CYC;                          /**< Submodule 0 Capture Value 4 Cycle..Submodule 3 Capture Value 4 Cycle, array offset: 0x52, array step: 0x60 */
    __I  uint16_t CVAL5;                             /**< Submodule 0 Capture Value 5..Submodule 3 Capture Value 5, array offset: 0x54, array step: 0x60 */
    __I  uint16_t CVAL5CYC;                          /**< Submodule 0 Capture Value 5 Cycle..Submodule 3 Capture Value 5 Cycle, array offset: 0x56, array step: 0x60 */
    __IO uint16_t PHASEDLY;                          /**< Submodule 1 Phase Delay..Submodule 3 Phase Delay, array offset: 0x58, array step: 0x60, valid indices: [1-3] */
    uint8_t RESERVED_1[6];
  } SM[FLEXPWM_SM_COUNT];
  __IO uint16_t OUTEN;                             /**< Output Enable, offset: 0x180 */
  __IO uint16_t MASK;                              /**< Mask, offset: 0x182 */
  __IO uint16_t SWCOUT;                            /**< Software Controlled Output, offset: 0x184 */
  __IO uint16_t DTSRCSEL;                          /**< PWM Source Select, offset: 0x186 */
  __IO uint16_t MCTRL;                             /**< Master Control, offset: 0x188 */
  __IO uint16_t MCTRL2;                            /**< Master Control 2, offset: 0x18A */
  struct FLEXPWM_FP {                              /* offset: 0x18C, array step: 0xA */
    __IO uint16_t CTRL;                              /**< Fault Protection 0 Control, array offset: 0x18C, array step: 0xA */
    __IO uint16_t STS;                               /**< Fault Protection 0 Status, array offset: 0x18E, array step: 0xA */
    __IO uint16_t FILT;                              /**< Fault Protection 0 Filter, array offset: 0x190, array step: 0xA */
    __IO uint16_t TST;                               /**< Fault Protection 0 Test, array offset: 0x192, array step: 0xA */
    __IO uint16_t CTRL2;                             /**< Fault Protection 0 Control 2, array offset: 0x194, array step: 0xA */
  } FP[FLEXPWM_FP_COUNT];
  uint8_t RESERVED_0[26];
  __IO uint16_t DLLSR;                             /**< DLL Status, offset: 0x1B0 */
  uint8_t RESERVED_1[6];
  __IO uint16_t SM0_BIST_CTRL;                     /**< Submodule 0 BIST Control, offset: 0x1B8 */
  __IO uint16_t SM0_BIST_CTRL1;                    /**< Submodule 0 BIST Control, offset: 0x1BA */
  __IO uint16_t SM1_BIST_CTRL;                     /**< Submodule 1 BIST Control, offset: 0x1BC */
  __IO uint16_t SM1_BIST_CTRL1;                    /**< Submodule 1 BIST Control, offset: 0x1BE */
  __IO uint16_t SM2_BIST_CTRL;                     /**< Submodule 2 BIST Control, offset: 0x1C0 */
  __IO uint16_t SM2_BIST_CTRL1;                    /**< Submodule 2 BIST Control, offset: 0x1C2 */
  __IO uint16_t SM3_BIST_CTRL;                     /**< Submodule 3 BIST Control, offset: 0x1C4 */
  __IO uint16_t SM3_BIST_CTRL1;                    /**< Submodule 3 BIST Control, offset: 0x1C6 */
  __I  uint16_t SM0_BIST_STATUS;                   /**< Submodule 0 BIST Status, offset: 0x1C8 */
  __I  uint16_t SM0_BIST_STATUS1;                  /**< Submodule 0 BIST Status, offset: 0x1CA */
  __I  uint16_t SM1_BIST_STATUS;                   /**< Submodule 1 BIST Status, offset: 0x1CC */
  __I  uint16_t SM1_BIST_STATUS1;                  /**< Submodule 1 BIST Status, offset: 0x1CE */
  __I  uint16_t SM2_BIST_STATUS;                   /**< Submodule 2 BIST Status, offset: 0x1D0 */
  __I  uint16_t SM2_BIST_STATUS1;                  /**< Submodule 2 BIST Status, offset: 0x1D2 */
  __I  uint16_t SM3_BIST_STATUS;                   /**< Submodule 3 BIST Status, offset: 0x1D4 */
  __I  uint16_t SM3_BIST_STATUS1;                  /**< Submodule 3 BIST Status, offset: 0x1D6 */
} FLEXPWM_Type, *FLEXPWM_MemMapPtr;

