rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FLEXPWM.h
/** Number of instances of the FLEXPWM module. */
#define FLEXPWM_INSTANCE_COUNT                   (2u)

/* FLEXPWM - Peripheral instance base addresses */
/** Peripheral EFLEXPWM_0 base address */
#define IP_EFLEXPWM_0_BASE                       (0x406B8000u)
/** Peripheral EFLEXPWM_0 base pointer */
#define IP_EFLEXPWM_0                            ((FLEXPWM_Type *)IP_EFLEXPWM_0_BASE)
/** Peripheral EFLEXPWM_1 base address */
#define IP_EFLEXPWM_1_BASE                       (0x406BC000u)
/** Peripheral EFLEXPWM_1 base pointer */
#define IP_EFLEXPWM_1                            ((FLEXPWM_Type *)IP_EFLEXPWM_1_BASE)
/** Array initializer of FLEXPWM peripheral base addresses */
#define IP_FLEXPWM_BASE_ADDRS                    { IP_EFLEXPWM_0_BASE, IP_EFLEXPWM_1_BASE }
/** Array initializer of FLEXPWM peripheral base pointers */
#define IP_FLEXPWM_BASE_PTRS                     { IP_EFLEXPWM_0, IP_EFLEXPWM_1 }

/* ----------------------------------------------------------------------------
   -- FLEXPWM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXPWM_Register_Masks FLEXPWM Register Masks
 * @{
 */

/*! @name CNT - Submodule 0 Counter..Submodule 3 Counter */
/*! @{ */

#define FLEXPWM_CNT_CNT_MASK                     (0xFFFFU)
#define FLEXPWM_CNT_CNT_SHIFT                    (0U)
#define FLEXPWM_CNT_CNT_WIDTH                    (16U)
#define FLEXPWM_CNT_CNT(x)                       (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CNT_CNT_SHIFT)) & FLEXPWM_CNT_CNT_MASK)
/*! @} */

/*! @name INIT - Submodule 0 Initial Count..Submodule 3 Initial Count */
/*! @{ */

#define FLEXPWM_INIT_INIT_MASK                   (0xFFFFU)
#define FLEXPWM_INIT_INIT_SHIFT                  (0U)
#define FLEXPWM_INIT_INIT_WIDTH                  (16U)
#define FLEXPWM_INIT_INIT(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_INIT_INIT_SHIFT)) & FLEXPWM_INIT_INIT_MASK)
/*! @} */

/*! @name CTRL2 - Submodule 0 Control 2..Submodule 3 Control 2 */
/*! @{ */

#define FLEXPWM_CTRL2_CLK_SEL_MASK               (0x3U)
#define FLEXPWM_CTRL2_CLK_SEL_SHIFT              (0U)
#define FLEXPWM_CTRL2_CLK_SEL_WIDTH              (2U)
#define FLEXPWM_CTRL2_CLK_SEL(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_CLK_SEL_SHIFT)) & FLEXPWM_CTRL2_CLK_SEL_MASK)

#define FLEXPWM_CTRL2_RELOAD_SEL_MASK            (0x4U)
#define FLEXPWM_CTRL2_RELOAD_SEL_SHIFT           (2U)
#define FLEXPWM_CTRL2_RELOAD_SEL_WIDTH           (1U)
#define FLEXPWM_CTRL2_RELOAD_SEL(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_RELOAD_SEL_SHIFT)) & FLEXPWM_CTRL2_RELOAD_SEL_MASK)

#define FLEXPWM_CTRL2_FORCE_SEL_MASK             (0x38U)
#define FLEXPWM_CTRL2_FORCE_SEL_SHIFT            (3U)
#define FLEXPWM_CTRL2_FORCE_SEL_WIDTH            (3U)
#define FLEXPWM_CTRL2_FORCE_SEL(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_FORCE_SEL_SHIFT)) & FLEXPWM_CTRL2_FORCE_SEL_MASK)

#define FLEXPWM_CTRL2_FORCE_MASK                 (0x40U)
#define FLEXPWM_CTRL2_FORCE_SHIFT                (6U)
#define FLEXPWM_CTRL2_FORCE_WIDTH                (1U)
#define FLEXPWM_CTRL2_FORCE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_FORCE_SHIFT)) & FLEXPWM_CTRL2_FORCE_MASK)

#define FLEXPWM_CTRL2_FRCEN_MASK                 (0x80U)
#define FLEXPWM_CTRL2_FRCEN_SHIFT                (7U)
#define FLEXPWM_CTRL2_FRCEN_WIDTH                (1U)
#define FLEXPWM_CTRL2_FRCEN(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_FRCEN_SHIFT)) & FLEXPWM_CTRL2_FRCEN_MASK)

#define FLEXPWM_CTRL2_INIT_SEL_MASK              (0x300U)
#define FLEXPWM_CTRL2_INIT_SEL_SHIFT             (8U)
#define FLEXPWM_CTRL2_INIT_SEL_WIDTH             (2U)
#define FLEXPWM_CTRL2_INIT_SEL(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_INIT_SEL_SHIFT)) & FLEXPWM_CTRL2_INIT_SEL_MASK)

#define FLEXPWM_CTRL2_PWMX_INIT_MASK             (0x400U)
#define FLEXPWM_CTRL2_PWMX_INIT_SHIFT            (10U)
#define FLEXPWM_CTRL2_PWMX_INIT_WIDTH            (1U)
#define FLEXPWM_CTRL2_PWMX_INIT(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_PWMX_INIT_SHIFT)) & FLEXPWM_CTRL2_PWMX_INIT_MASK)

#define FLEXPWM_CTRL2_PWM45_INIT_MASK            (0x800U)
#define FLEXPWM_CTRL2_PWM45_INIT_SHIFT           (11U)
#define FLEXPWM_CTRL2_PWM45_INIT_WIDTH           (1U)
#define FLEXPWM_CTRL2_PWM45_INIT(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_PWM45_INIT_SHIFT)) & FLEXPWM_CTRL2_PWM45_INIT_MASK)

#define FLEXPWM_CTRL2_PWM23_INIT_MASK            (0x1000U)
#define FLEXPWM_CTRL2_PWM23_INIT_SHIFT           (12U)
#define FLEXPWM_CTRL2_PWM23_INIT_WIDTH           (1U)
#define FLEXPWM_CTRL2_PWM23_INIT(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_PWM23_INIT_SHIFT)) & FLEXPWM_CTRL2_PWM23_INIT_MASK)

#define FLEXPWM_CTRL2_INDEP_MASK                 (0x2000U)
#define FLEXPWM_CTRL2_INDEP_SHIFT                (13U)
#define FLEXPWM_CTRL2_INDEP_WIDTH                (1U)
#define FLEXPWM_CTRL2_INDEP(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_INDEP_SHIFT)) & FLEXPWM_CTRL2_INDEP_MASK)

#define FLEXPWM_CTRL2_WAITEN_MASK                (0x4000U)
#define FLEXPWM_CTRL2_WAITEN_SHIFT               (14U)
#define FLEXPWM_CTRL2_WAITEN_WIDTH               (1U)
#define FLEXPWM_CTRL2_WAITEN(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_WAITEN_SHIFT)) & FLEXPWM_CTRL2_WAITEN_MASK)

#define FLEXPWM_CTRL2_DBGEN_MASK                 (0x8000U)
#define FLEXPWM_CTRL2_DBGEN_SHIFT                (15U)
#define FLEXPWM_CTRL2_DBGEN_WIDTH                (1U)
#define FLEXPWM_CTRL2_DBGEN(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_DBGEN_SHIFT)) & FLEXPWM_CTRL2_DBGEN_MASK)
/*! @} */

/*! @name CTRL - Submodule 0 Control..Submodule 3 Control */
/*! @{ */

#define FLEXPWM_CTRL_DBLEN_MASK                  (0x1U)
#define FLEXPWM_CTRL_DBLEN_SHIFT                 (0U)
#define FLEXPWM_CTRL_DBLEN_WIDTH                 (1U)
#define FLEXPWM_CTRL_DBLEN(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_DBLEN_SHIFT)) & FLEXPWM_CTRL_DBLEN_MASK)

#define FLEXPWM_CTRL_DBLX_MASK                   (0x2U)
#define FLEXPWM_CTRL_DBLX_SHIFT                  (1U)
#define FLEXPWM_CTRL_DBLX_WIDTH                  (1U)
#define FLEXPWM_CTRL_DBLX(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_DBLX_SHIFT)) & FLEXPWM_CTRL_DBLX_MASK)

#define FLEXPWM_CTRL_LDMOD_MASK                  (0x4U)
#define FLEXPWM_CTRL_LDMOD_SHIFT                 (2U)
#define FLEXPWM_CTRL_LDMOD_WIDTH                 (1U)
#define FLEXPWM_CTRL_LDMOD(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_LDMOD_SHIFT)) & FLEXPWM_CTRL_LDMOD_MASK)

#define FLEXPWM_CTRL_SPLIT_MASK                  (0x8U)
#define FLEXPWM_CTRL_SPLIT_SHIFT                 (3U)
#define FLEXPWM_CTRL_SPLIT_WIDTH                 (1U)
#define FLEXPWM_CTRL_SPLIT(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_SPLIT_SHIFT)) & FLEXPWM_CTRL_SPLIT_MASK)

#define FLEXPWM_CTRL_PRSC_MASK                   (0x70U)
#define FLEXPWM_CTRL_PRSC_SHIFT                  (4U)
#define FLEXPWM_CTRL_PRSC_WIDTH                  (3U)
#define FLEXPWM_CTRL_PRSC(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_PRSC_SHIFT)) & FLEXPWM_CTRL_PRSC_MASK)

#define FLEXPWM_CTRL_COMPMODE_MASK               (0x80U)
#define FLEXPWM_CTRL_COMPMODE_SHIFT              (7U)
#define FLEXPWM_CTRL_COMPMODE_WIDTH              (1U)
#define FLEXPWM_CTRL_COMPMODE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_COMPMODE_SHIFT)) & FLEXPWM_CTRL_COMPMODE_MASK)

