rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FLEXPWM.h
#define FLEXPWM_CTRL_DT_MASK                     (0x300U)
#define FLEXPWM_CTRL_DT_SHIFT                    (8U)
#define FLEXPWM_CTRL_DT_WIDTH                    (2U)
#define FLEXPWM_CTRL_DT(x)                       (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_DT_SHIFT)) & FLEXPWM_CTRL_DT_MASK)

#define FLEXPWM_CTRL_FULL_MASK                   (0x400U)
#define FLEXPWM_CTRL_FULL_SHIFT                  (10U)
#define FLEXPWM_CTRL_FULL_WIDTH                  (1U)
#define FLEXPWM_CTRL_FULL(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_FULL_SHIFT)) & FLEXPWM_CTRL_FULL_MASK)

#define FLEXPWM_CTRL_HALF_MASK                   (0x800U)
#define FLEXPWM_CTRL_HALF_SHIFT                  (11U)
#define FLEXPWM_CTRL_HALF_WIDTH                  (1U)
#define FLEXPWM_CTRL_HALF(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_HALF_SHIFT)) & FLEXPWM_CTRL_HALF_MASK)

#define FLEXPWM_CTRL_LDFQ_MASK                   (0xF000U)
#define FLEXPWM_CTRL_LDFQ_SHIFT                  (12U)
#define FLEXPWM_CTRL_LDFQ_WIDTH                  (4U)
#define FLEXPWM_CTRL_LDFQ(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_LDFQ_SHIFT)) & FLEXPWM_CTRL_LDFQ_MASK)
/*! @} */

/*! @name VAL0 - Submodule 0 Value 0..Submodule 3 Value 0 */
/*! @{ */

#define FLEXPWM_VAL0_VAL0_MASK                   (0xFFFFU)
#define FLEXPWM_VAL0_VAL0_SHIFT                  (0U)
#define FLEXPWM_VAL0_VAL0_WIDTH                  (16U)
#define FLEXPWM_VAL0_VAL0(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_VAL0_VAL0_SHIFT)) & FLEXPWM_VAL0_VAL0_MASK)
/*! @} */

/*! @name FRACVAL1 - Submodule 0 Fractional Value 1..Submodule 3 Fractional Value 1 */
/*! @{ */

#define FLEXPWM_FRACVAL1_FRACVAL1_MASK           (0xF800U)
#define FLEXPWM_FRACVAL1_FRACVAL1_SHIFT          (11U)
#define FLEXPWM_FRACVAL1_FRACVAL1_WIDTH          (5U)
#define FLEXPWM_FRACVAL1_FRACVAL1(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FRACVAL1_FRACVAL1_SHIFT)) & FLEXPWM_FRACVAL1_FRACVAL1_MASK)
/*! @} */

/*! @name VAL1 - Submodule 0 Value 1..Submodule 3 Value 1 */
/*! @{ */

#define FLEXPWM_VAL1_VAL1_MASK                   (0xFFFFU)
#define FLEXPWM_VAL1_VAL1_SHIFT                  (0U)
#define FLEXPWM_VAL1_VAL1_WIDTH                  (16U)
#define FLEXPWM_VAL1_VAL1(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_VAL1_VAL1_SHIFT)) & FLEXPWM_VAL1_VAL1_MASK)
/*! @} */

/*! @name FRACVAL2 - Submodule 0 Fractional Value 2..Submodule 3 Fractional Value 2 */
/*! @{ */

#define FLEXPWM_FRACVAL2_FRACVAL2_MASK           (0xF800U)
#define FLEXPWM_FRACVAL2_FRACVAL2_SHIFT          (11U)
#define FLEXPWM_FRACVAL2_FRACVAL2_WIDTH          (5U)
#define FLEXPWM_FRACVAL2_FRACVAL2(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FRACVAL2_FRACVAL2_SHIFT)) & FLEXPWM_FRACVAL2_FRACVAL2_MASK)
/*! @} */

/*! @name VAL2 - Submodule 0 Value 2..Submodule 3 Value 2 */
/*! @{ */

#define FLEXPWM_VAL2_VAL2_MASK                   (0xFFFFU)
#define FLEXPWM_VAL2_VAL2_SHIFT                  (0U)
#define FLEXPWM_VAL2_VAL2_WIDTH                  (16U)
#define FLEXPWM_VAL2_VAL2(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_VAL2_VAL2_SHIFT)) & FLEXPWM_VAL2_VAL2_MASK)
/*! @} */

/*! @name FRACVAL3 - Submodule 0 Fractional Value 3..Submodule 3 Fractional Value 3 */
/*! @{ */

#define FLEXPWM_FRACVAL3_FRACVAL3_MASK           (0xF800U)
#define FLEXPWM_FRACVAL3_FRACVAL3_SHIFT          (11U)
#define FLEXPWM_FRACVAL3_FRACVAL3_WIDTH          (5U)
#define FLEXPWM_FRACVAL3_FRACVAL3(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FRACVAL3_FRACVAL3_SHIFT)) & FLEXPWM_FRACVAL3_FRACVAL3_MASK)
/*! @} */

/*! @name VAL3 - Submodule 0 Value 3..Submodule 3 Value 3 */
/*! @{ */

#define FLEXPWM_VAL3_VAL3_MASK                   (0xFFFFU)
#define FLEXPWM_VAL3_VAL3_SHIFT                  (0U)
#define FLEXPWM_VAL3_VAL3_WIDTH                  (16U)
#define FLEXPWM_VAL3_VAL3(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_VAL3_VAL3_SHIFT)) & FLEXPWM_VAL3_VAL3_MASK)
/*! @} */

/*! @name FRACVAL4 - Submodule 0 Fractional Value 4..Submodule 3 Fractional Value 4 */
/*! @{ */

#define FLEXPWM_FRACVAL4_FRACVAL4_MASK           (0xF800U)
#define FLEXPWM_FRACVAL4_FRACVAL4_SHIFT          (11U)
#define FLEXPWM_FRACVAL4_FRACVAL4_WIDTH          (5U)
#define FLEXPWM_FRACVAL4_FRACVAL4(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FRACVAL4_FRACVAL4_SHIFT)) & FLEXPWM_FRACVAL4_FRACVAL4_MASK)
/*! @} */

/*! @name VAL4 - Submodule 0 Value 4..Submodule 3 Value 4 */
/*! @{ */

#define FLEXPWM_VAL4_VAL4_MASK                   (0xFFFFU)
#define FLEXPWM_VAL4_VAL4_SHIFT                  (0U)
#define FLEXPWM_VAL4_VAL4_WIDTH                  (16U)
#define FLEXPWM_VAL4_VAL4(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_VAL4_VAL4_SHIFT)) & FLEXPWM_VAL4_VAL4_MASK)
/*! @} */

/*! @name FRACVAL5 - Submodule 0 Fractional Value 5..Submodule 3 Fractional Value 5 */
/*! @{ */

#define FLEXPWM_FRACVAL5_FRACVAL5_MASK           (0xF800U)
#define FLEXPWM_FRACVAL5_FRACVAL5_SHIFT          (11U)
#define FLEXPWM_FRACVAL5_FRACVAL5_WIDTH          (5U)
#define FLEXPWM_FRACVAL5_FRACVAL5(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FRACVAL5_FRACVAL5_SHIFT)) & FLEXPWM_FRACVAL5_FRACVAL5_MASK)
/*! @} */

/*! @name VAL5 - Submodule 0 Value 5..Submodule 3 Value 5 */
/*! @{ */

#define FLEXPWM_VAL5_VAL5_MASK                   (0xFFFFU)
#define FLEXPWM_VAL5_VAL5_SHIFT                  (0U)
#define FLEXPWM_VAL5_VAL5_WIDTH                  (16U)
#define FLEXPWM_VAL5_VAL5(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_VAL5_VAL5_SHIFT)) & FLEXPWM_VAL5_VAL5_MASK)
/*! @} */

/*! @name FRCTRL - Submodule 0 Fractional Control..Submodule 3 Fractional Control */
/*! @{ */

#define FLEXPWM_FRCTRL_FRAC1_EN_MASK             (0x2U)
#define FLEXPWM_FRCTRL_FRAC1_EN_SHIFT            (1U)
#define FLEXPWM_FRCTRL_FRAC1_EN_WIDTH            (1U)
#define FLEXPWM_FRCTRL_FRAC1_EN(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FRCTRL_FRAC1_EN_SHIFT)) & FLEXPWM_FRCTRL_FRAC1_EN_MASK)

#define FLEXPWM_FRCTRL_FRAC23_EN_MASK            (0x4U)
#define FLEXPWM_FRCTRL_FRAC23_EN_SHIFT           (2U)
#define FLEXPWM_FRCTRL_FRAC23_EN_WIDTH           (1U)
#define FLEXPWM_FRCTRL_FRAC23_EN(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FRCTRL_FRAC23_EN_SHIFT)) & FLEXPWM_FRCTRL_FRAC23_EN_MASK)

#define FLEXPWM_FRCTRL_FRAC45_EN_MASK            (0x10U)
#define FLEXPWM_FRCTRL_FRAC45_EN_SHIFT           (4U)
#define FLEXPWM_FRCTRL_FRAC45_EN_WIDTH           (1U)
#define FLEXPWM_FRCTRL_FRAC45_EN(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FRCTRL_FRAC45_EN_SHIFT)) & FLEXPWM_FRCTRL_FRAC45_EN_MASK)

