rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FLEXPWM.h
#define FLEXPWM_FRCTRL_FRAC_PU_MASK              (0x100U)
#define FLEXPWM_FRCTRL_FRAC_PU_SHIFT             (8U)
#define FLEXPWM_FRCTRL_FRAC_PU_WIDTH             (1U)
#define FLEXPWM_FRCTRL_FRAC_PU(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FRCTRL_FRAC_PU_SHIFT)) & FLEXPWM_FRCTRL_FRAC_PU_MASK)
/*! @} */

/*! @name OCTRL - Submodule 0 Output Control..Submodule 3 Output Control */
/*! @{ */

#define FLEXPWM_OCTRL_PWMXFS_MASK                (0x3U)
#define FLEXPWM_OCTRL_PWMXFS_SHIFT               (0U)
#define FLEXPWM_OCTRL_PWMXFS_WIDTH               (2U)
#define FLEXPWM_OCTRL_PWMXFS(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OCTRL_PWMXFS_SHIFT)) & FLEXPWM_OCTRL_PWMXFS_MASK)

#define FLEXPWM_OCTRL_PWMBFS_MASK                (0xCU)
#define FLEXPWM_OCTRL_PWMBFS_SHIFT               (2U)
#define FLEXPWM_OCTRL_PWMBFS_WIDTH               (2U)
#define FLEXPWM_OCTRL_PWMBFS(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OCTRL_PWMBFS_SHIFT)) & FLEXPWM_OCTRL_PWMBFS_MASK)

#define FLEXPWM_OCTRL_PWMAFS_MASK                (0x30U)
#define FLEXPWM_OCTRL_PWMAFS_SHIFT               (4U)
#define FLEXPWM_OCTRL_PWMAFS_WIDTH               (2U)
#define FLEXPWM_OCTRL_PWMAFS(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OCTRL_PWMAFS_SHIFT)) & FLEXPWM_OCTRL_PWMAFS_MASK)

#define FLEXPWM_OCTRL_POLX_MASK                  (0x100U)
#define FLEXPWM_OCTRL_POLX_SHIFT                 (8U)
#define FLEXPWM_OCTRL_POLX_WIDTH                 (1U)
#define FLEXPWM_OCTRL_POLX(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OCTRL_POLX_SHIFT)) & FLEXPWM_OCTRL_POLX_MASK)

#define FLEXPWM_OCTRL_POLB_MASK                  (0x200U)
#define FLEXPWM_OCTRL_POLB_SHIFT                 (9U)
#define FLEXPWM_OCTRL_POLB_WIDTH                 (1U)
#define FLEXPWM_OCTRL_POLB(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OCTRL_POLB_SHIFT)) & FLEXPWM_OCTRL_POLB_MASK)

#define FLEXPWM_OCTRL_POLA_MASK                  (0x400U)
#define FLEXPWM_OCTRL_POLA_SHIFT                 (10U)
#define FLEXPWM_OCTRL_POLA_WIDTH                 (1U)
#define FLEXPWM_OCTRL_POLA(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OCTRL_POLA_SHIFT)) & FLEXPWM_OCTRL_POLA_MASK)

#define FLEXPWM_OCTRL_PWMX_IN_MASK               (0x2000U)
#define FLEXPWM_OCTRL_PWMX_IN_SHIFT              (13U)
#define FLEXPWM_OCTRL_PWMX_IN_WIDTH              (1U)
#define FLEXPWM_OCTRL_PWMX_IN(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OCTRL_PWMX_IN_SHIFT)) & FLEXPWM_OCTRL_PWMX_IN_MASK)

#define FLEXPWM_OCTRL_PWMB_IN_MASK               (0x4000U)
#define FLEXPWM_OCTRL_PWMB_IN_SHIFT              (14U)
#define FLEXPWM_OCTRL_PWMB_IN_WIDTH              (1U)
#define FLEXPWM_OCTRL_PWMB_IN(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OCTRL_PWMB_IN_SHIFT)) & FLEXPWM_OCTRL_PWMB_IN_MASK)

#define FLEXPWM_OCTRL_PWMA_IN_MASK               (0x8000U)
#define FLEXPWM_OCTRL_PWMA_IN_SHIFT              (15U)
#define FLEXPWM_OCTRL_PWMA_IN_WIDTH              (1U)
#define FLEXPWM_OCTRL_PWMA_IN(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OCTRL_PWMA_IN_SHIFT)) & FLEXPWM_OCTRL_PWMA_IN_MASK)
/*! @} */

/*! @name STS - Submodule 0 Status..Submodule 3 Status */
/*! @{ */

#define FLEXPWM_STS_CMPF_MASK                    (0x3FU)
#define FLEXPWM_STS_CMPF_SHIFT                   (0U)
#define FLEXPWM_STS_CMPF_WIDTH                   (6U)
#define FLEXPWM_STS_CMPF(x)                      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_CMPF_SHIFT)) & FLEXPWM_STS_CMPF_MASK)

#define FLEXPWM_STS_CFX0_MASK                    (0x40U)
#define FLEXPWM_STS_CFX0_SHIFT                   (6U)
#define FLEXPWM_STS_CFX0_WIDTH                   (1U)
#define FLEXPWM_STS_CFX0(x)                      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_CFX0_SHIFT)) & FLEXPWM_STS_CFX0_MASK)

#define FLEXPWM_STS_CFX1_MASK                    (0x80U)
#define FLEXPWM_STS_CFX1_SHIFT                   (7U)
#define FLEXPWM_STS_CFX1_WIDTH                   (1U)
#define FLEXPWM_STS_CFX1(x)                      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_CFX1_SHIFT)) & FLEXPWM_STS_CFX1_MASK)

#define FLEXPWM_STS_CFB0_MASK                    (0x100U)
#define FLEXPWM_STS_CFB0_SHIFT                   (8U)
#define FLEXPWM_STS_CFB0_WIDTH                   (1U)
#define FLEXPWM_STS_CFB0(x)                      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_CFB0_SHIFT)) & FLEXPWM_STS_CFB0_MASK)

#define FLEXPWM_STS_CFB1_MASK                    (0x200U)
#define FLEXPWM_STS_CFB1_SHIFT                   (9U)
#define FLEXPWM_STS_CFB1_WIDTH                   (1U)
#define FLEXPWM_STS_CFB1(x)                      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_CFB1_SHIFT)) & FLEXPWM_STS_CFB1_MASK)

#define FLEXPWM_STS_CFA0_MASK                    (0x400U)
#define FLEXPWM_STS_CFA0_SHIFT                   (10U)
#define FLEXPWM_STS_CFA0_WIDTH                   (1U)
#define FLEXPWM_STS_CFA0(x)                      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_CFA0_SHIFT)) & FLEXPWM_STS_CFA0_MASK)

#define FLEXPWM_STS_CFA1_MASK                    (0x800U)
#define FLEXPWM_STS_CFA1_SHIFT                   (11U)
#define FLEXPWM_STS_CFA1_WIDTH                   (1U)
#define FLEXPWM_STS_CFA1(x)                      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_CFA1_SHIFT)) & FLEXPWM_STS_CFA1_MASK)

#define FLEXPWM_STS_RF_MASK                      (0x1000U)
#define FLEXPWM_STS_RF_SHIFT                     (12U)
#define FLEXPWM_STS_RF_WIDTH                     (1U)
#define FLEXPWM_STS_RF(x)                        (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_RF_SHIFT)) & FLEXPWM_STS_RF_MASK)

#define FLEXPWM_STS_REF_MASK                     (0x2000U)
#define FLEXPWM_STS_REF_SHIFT                    (13U)
#define FLEXPWM_STS_REF_WIDTH                    (1U)
#define FLEXPWM_STS_REF(x)                       (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_REF_SHIFT)) & FLEXPWM_STS_REF_MASK)

#define FLEXPWM_STS_RUF_MASK                     (0x4000U)
#define FLEXPWM_STS_RUF_SHIFT                    (14U)
#define FLEXPWM_STS_RUF_WIDTH                    (1U)
#define FLEXPWM_STS_RUF(x)                       (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_RUF_SHIFT)) & FLEXPWM_STS_RUF_MASK)
/*! @} */

/*! @name INTEN - Submodule 0 Interrupt Enable..Submodule 3 Interrupt Enable */
/*! @{ */

#define FLEXPWM_INTEN_CMPIE_MASK                 (0x3FU)
#define FLEXPWM_INTEN_CMPIE_SHIFT                (0U)
#define FLEXPWM_INTEN_CMPIE_WIDTH                (6U)
#define FLEXPWM_INTEN_CMPIE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_INTEN_CMPIE_SHIFT)) & FLEXPWM_INTEN_CMPIE_MASK)

#define FLEXPWM_INTEN_CX0IE_MASK                 (0x40U)
#define FLEXPWM_INTEN_CX0IE_SHIFT                (6U)
#define FLEXPWM_INTEN_CX0IE_WIDTH                (1U)
#define FLEXPWM_INTEN_CX0IE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_INTEN_CX0IE_SHIFT)) & FLEXPWM_INTEN_CX0IE_MASK)

