rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FLEXPWM.h
#define FLEXPWM_INTEN_CX1IE_MASK                 (0x80U)
#define FLEXPWM_INTEN_CX1IE_SHIFT                (7U)
#define FLEXPWM_INTEN_CX1IE_WIDTH                (1U)
#define FLEXPWM_INTEN_CX1IE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_INTEN_CX1IE_SHIFT)) & FLEXPWM_INTEN_CX1IE_MASK)

#define FLEXPWM_INTEN_CB0IE_MASK                 (0x100U)
#define FLEXPWM_INTEN_CB0IE_SHIFT                (8U)
#define FLEXPWM_INTEN_CB0IE_WIDTH                (1U)
#define FLEXPWM_INTEN_CB0IE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_INTEN_CB0IE_SHIFT)) & FLEXPWM_INTEN_CB0IE_MASK)

#define FLEXPWM_INTEN_CB1IE_MASK                 (0x200U)
#define FLEXPWM_INTEN_CB1IE_SHIFT                (9U)
#define FLEXPWM_INTEN_CB1IE_WIDTH                (1U)
#define FLEXPWM_INTEN_CB1IE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_INTEN_CB1IE_SHIFT)) & FLEXPWM_INTEN_CB1IE_MASK)

#define FLEXPWM_INTEN_CA0IE_MASK                 (0x400U)
#define FLEXPWM_INTEN_CA0IE_SHIFT                (10U)
#define FLEXPWM_INTEN_CA0IE_WIDTH                (1U)
#define FLEXPWM_INTEN_CA0IE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_INTEN_CA0IE_SHIFT)) & FLEXPWM_INTEN_CA0IE_MASK)

#define FLEXPWM_INTEN_CA1IE_MASK                 (0x800U)
#define FLEXPWM_INTEN_CA1IE_SHIFT                (11U)
#define FLEXPWM_INTEN_CA1IE_WIDTH                (1U)
#define FLEXPWM_INTEN_CA1IE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_INTEN_CA1IE_SHIFT)) & FLEXPWM_INTEN_CA1IE_MASK)

#define FLEXPWM_INTEN_RIE_MASK                   (0x1000U)
#define FLEXPWM_INTEN_RIE_SHIFT                  (12U)
#define FLEXPWM_INTEN_RIE_WIDTH                  (1U)
#define FLEXPWM_INTEN_RIE(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_INTEN_RIE_SHIFT)) & FLEXPWM_INTEN_RIE_MASK)

#define FLEXPWM_INTEN_REIE_MASK                  (0x2000U)
#define FLEXPWM_INTEN_REIE_SHIFT                 (13U)
#define FLEXPWM_INTEN_REIE_WIDTH                 (1U)
#define FLEXPWM_INTEN_REIE(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_INTEN_REIE_SHIFT)) & FLEXPWM_INTEN_REIE_MASK)
/*! @} */

/*! @name DMAEN - Submodule 0 DMA Enable..Submodule 3 DMA Enable */
/*! @{ */

#define FLEXPWM_DMAEN_CX0DE_MASK                 (0x1U)
#define FLEXPWM_DMAEN_CX0DE_SHIFT                (0U)
#define FLEXPWM_DMAEN_CX0DE_WIDTH                (1U)
#define FLEXPWM_DMAEN_CX0DE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DMAEN_CX0DE_SHIFT)) & FLEXPWM_DMAEN_CX0DE_MASK)

#define FLEXPWM_DMAEN_CX1DE_MASK                 (0x2U)
#define FLEXPWM_DMAEN_CX1DE_SHIFT                (1U)
#define FLEXPWM_DMAEN_CX1DE_WIDTH                (1U)
#define FLEXPWM_DMAEN_CX1DE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DMAEN_CX1DE_SHIFT)) & FLEXPWM_DMAEN_CX1DE_MASK)

#define FLEXPWM_DMAEN_CB0DE_MASK                 (0x4U)
#define FLEXPWM_DMAEN_CB0DE_SHIFT                (2U)
#define FLEXPWM_DMAEN_CB0DE_WIDTH                (1U)
#define FLEXPWM_DMAEN_CB0DE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DMAEN_CB0DE_SHIFT)) & FLEXPWM_DMAEN_CB0DE_MASK)

#define FLEXPWM_DMAEN_CB1DE_MASK                 (0x8U)
#define FLEXPWM_DMAEN_CB1DE_SHIFT                (3U)
#define FLEXPWM_DMAEN_CB1DE_WIDTH                (1U)
#define FLEXPWM_DMAEN_CB1DE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DMAEN_CB1DE_SHIFT)) & FLEXPWM_DMAEN_CB1DE_MASK)

#define FLEXPWM_DMAEN_CA0DE_MASK                 (0x10U)
#define FLEXPWM_DMAEN_CA0DE_SHIFT                (4U)
#define FLEXPWM_DMAEN_CA0DE_WIDTH                (1U)
#define FLEXPWM_DMAEN_CA0DE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DMAEN_CA0DE_SHIFT)) & FLEXPWM_DMAEN_CA0DE_MASK)

#define FLEXPWM_DMAEN_CA1DE_MASK                 (0x20U)
#define FLEXPWM_DMAEN_CA1DE_SHIFT                (5U)
#define FLEXPWM_DMAEN_CA1DE_WIDTH                (1U)
#define FLEXPWM_DMAEN_CA1DE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DMAEN_CA1DE_SHIFT)) & FLEXPWM_DMAEN_CA1DE_MASK)

#define FLEXPWM_DMAEN_CAPTDE_MASK                (0xC0U)
#define FLEXPWM_DMAEN_CAPTDE_SHIFT               (6U)
#define FLEXPWM_DMAEN_CAPTDE_WIDTH               (2U)
#define FLEXPWM_DMAEN_CAPTDE(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DMAEN_CAPTDE_SHIFT)) & FLEXPWM_DMAEN_CAPTDE_MASK)

#define FLEXPWM_DMAEN_FAND_MASK                  (0x100U)
#define FLEXPWM_DMAEN_FAND_SHIFT                 (8U)
#define FLEXPWM_DMAEN_FAND_WIDTH                 (1U)
#define FLEXPWM_DMAEN_FAND(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DMAEN_FAND_SHIFT)) & FLEXPWM_DMAEN_FAND_MASK)

#define FLEXPWM_DMAEN_VALDE_MASK                 (0x200U)
#define FLEXPWM_DMAEN_VALDE_SHIFT                (9U)
#define FLEXPWM_DMAEN_VALDE_WIDTH                (1U)
#define FLEXPWM_DMAEN_VALDE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DMAEN_VALDE_SHIFT)) & FLEXPWM_DMAEN_VALDE_MASK)
/*! @} */

/*! @name TCTRL - Submodule 0 Output Trigger Control..Submodule 3 Output Trigger Control */
/*! @{ */

#define FLEXPWM_TCTRL_OUT_TRIG_EN_MASK           (0x3FU)
#define FLEXPWM_TCTRL_OUT_TRIG_EN_SHIFT          (0U)
#define FLEXPWM_TCTRL_OUT_TRIG_EN_WIDTH          (6U)
#define FLEXPWM_TCTRL_OUT_TRIG_EN(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_TCTRL_OUT_TRIG_EN_SHIFT)) & FLEXPWM_TCTRL_OUT_TRIG_EN_MASK)

#define FLEXPWM_TCTRL_TRGFRQ_MASK                (0x1000U)
#define FLEXPWM_TCTRL_TRGFRQ_SHIFT               (12U)
#define FLEXPWM_TCTRL_TRGFRQ_WIDTH               (1U)
#define FLEXPWM_TCTRL_TRGFRQ(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_TCTRL_TRGFRQ_SHIFT)) & FLEXPWM_TCTRL_TRGFRQ_MASK)

#define FLEXPWM_TCTRL_PWBOT1_MASK                (0x4000U)
#define FLEXPWM_TCTRL_PWBOT1_SHIFT               (14U)
#define FLEXPWM_TCTRL_PWBOT1_WIDTH               (1U)
#define FLEXPWM_TCTRL_PWBOT1(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_TCTRL_PWBOT1_SHIFT)) & FLEXPWM_TCTRL_PWBOT1_MASK)

#define FLEXPWM_TCTRL_PWAOT0_MASK                (0x8000U)
#define FLEXPWM_TCTRL_PWAOT0_SHIFT               (15U)
#define FLEXPWM_TCTRL_PWAOT0_WIDTH               (1U)
#define FLEXPWM_TCTRL_PWAOT0(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_TCTRL_PWAOT0_SHIFT)) & FLEXPWM_TCTRL_PWAOT0_MASK)
/*! @} */

