rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FLEXPWM.h
/*! @name DISMAP0 - Submodule 0 Fault Disable Mapping..Submodule 3 Fault Disable Mapping */
/*! @{ */

#define FLEXPWM_DISMAP0_DIS0A_MASK               (0xFU)
#define FLEXPWM_DISMAP0_DIS0A_SHIFT              (0U)
#define FLEXPWM_DISMAP0_DIS0A_WIDTH              (4U)
#define FLEXPWM_DISMAP0_DIS0A(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DISMAP0_DIS0A_SHIFT)) & FLEXPWM_DISMAP0_DIS0A_MASK)

#define FLEXPWM_DISMAP0_DIS0B_MASK               (0xF0U)
#define FLEXPWM_DISMAP0_DIS0B_SHIFT              (4U)
#define FLEXPWM_DISMAP0_DIS0B_WIDTH              (4U)
#define FLEXPWM_DISMAP0_DIS0B(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DISMAP0_DIS0B_SHIFT)) & FLEXPWM_DISMAP0_DIS0B_MASK)

#define FLEXPWM_DISMAP0_DIS0X_MASK               (0xF00U)
#define FLEXPWM_DISMAP0_DIS0X_SHIFT              (8U)
#define FLEXPWM_DISMAP0_DIS0X_WIDTH              (4U)
#define FLEXPWM_DISMAP0_DIS0X(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DISMAP0_DIS0X_SHIFT)) & FLEXPWM_DISMAP0_DIS0X_MASK)
/*! @} */

/*! @name DISMAP1 - Submodule 0 Fault Disable Mapping..Submodule 3 Fault Disable Mapping */
/*! @{ */

#define FLEXPWM_DISMAP1_DIS1A_MASK               (0xFU)
#define FLEXPWM_DISMAP1_DIS1A_SHIFT              (0U)
#define FLEXPWM_DISMAP1_DIS1A_WIDTH              (4U)
#define FLEXPWM_DISMAP1_DIS1A(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DISMAP1_DIS1A_SHIFT)) & FLEXPWM_DISMAP1_DIS1A_MASK)

#define FLEXPWM_DISMAP1_DIS1B_MASK               (0xF0U)
#define FLEXPWM_DISMAP1_DIS1B_SHIFT              (4U)
#define FLEXPWM_DISMAP1_DIS1B_WIDTH              (4U)
#define FLEXPWM_DISMAP1_DIS1B(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DISMAP1_DIS1B_SHIFT)) & FLEXPWM_DISMAP1_DIS1B_MASK)

#define FLEXPWM_DISMAP1_DIS1X_MASK               (0xF00U)
#define FLEXPWM_DISMAP1_DIS1X_SHIFT              (8U)
#define FLEXPWM_DISMAP1_DIS1X_WIDTH              (4U)
#define FLEXPWM_DISMAP1_DIS1X(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DISMAP1_DIS1X_SHIFT)) & FLEXPWM_DISMAP1_DIS1X_MASK)
/*! @} */

/*! @name DTCNT0 - Submodule 0 Deadtime Count 0..Submodule 3 Deadtime Count 0 */
/*! @{ */

#define FLEXPWM_DTCNT0_DTCNT0_MASK               (0xFFFFU)
#define FLEXPWM_DTCNT0_DTCNT0_SHIFT              (0U)
#define FLEXPWM_DTCNT0_DTCNT0_WIDTH              (16U)
#define FLEXPWM_DTCNT0_DTCNT0(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DTCNT0_DTCNT0_SHIFT)) & FLEXPWM_DTCNT0_DTCNT0_MASK)
/*! @} */

/*! @name DTCNT1 - Submodule 0 Deadtime Count 1..Submodule 3 Deadtime Count 1 */
/*! @{ */

#define FLEXPWM_DTCNT1_DTCNT1_MASK               (0xFFFFU)
#define FLEXPWM_DTCNT1_DTCNT1_SHIFT              (0U)
#define FLEXPWM_DTCNT1_DTCNT1_WIDTH              (16U)
#define FLEXPWM_DTCNT1_DTCNT1(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DTCNT1_DTCNT1_SHIFT)) & FLEXPWM_DTCNT1_DTCNT1_MASK)
/*! @} */

/*! @name CAPTCTRLA - Submodule 0 Capture Control A..Submodule 3 Capture Control A */
/*! @{ */

#define FLEXPWM_CAPTCTRLA_ARMA_MASK              (0x1U)
#define FLEXPWM_CAPTCTRLA_ARMA_SHIFT             (0U)
#define FLEXPWM_CAPTCTRLA_ARMA_WIDTH             (1U)
#define FLEXPWM_CAPTCTRLA_ARMA(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLA_ARMA_SHIFT)) & FLEXPWM_CAPTCTRLA_ARMA_MASK)

#define FLEXPWM_CAPTCTRLA_ONESHOTA_MASK          (0x2U)
#define FLEXPWM_CAPTCTRLA_ONESHOTA_SHIFT         (1U)
#define FLEXPWM_CAPTCTRLA_ONESHOTA_WIDTH         (1U)
#define FLEXPWM_CAPTCTRLA_ONESHOTA(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLA_ONESHOTA_SHIFT)) & FLEXPWM_CAPTCTRLA_ONESHOTA_MASK)

#define FLEXPWM_CAPTCTRLA_EDGA0_MASK             (0xCU)
#define FLEXPWM_CAPTCTRLA_EDGA0_SHIFT            (2U)
#define FLEXPWM_CAPTCTRLA_EDGA0_WIDTH            (2U)
#define FLEXPWM_CAPTCTRLA_EDGA0(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLA_EDGA0_SHIFT)) & FLEXPWM_CAPTCTRLA_EDGA0_MASK)

#define FLEXPWM_CAPTCTRLA_EDGA1_MASK             (0x30U)
#define FLEXPWM_CAPTCTRLA_EDGA1_SHIFT            (4U)
#define FLEXPWM_CAPTCTRLA_EDGA1_WIDTH            (2U)
#define FLEXPWM_CAPTCTRLA_EDGA1(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLA_EDGA1_SHIFT)) & FLEXPWM_CAPTCTRLA_EDGA1_MASK)

#define FLEXPWM_CAPTCTRLA_INP_SELA_MASK          (0x40U)
#define FLEXPWM_CAPTCTRLA_INP_SELA_SHIFT         (6U)
#define FLEXPWM_CAPTCTRLA_INP_SELA_WIDTH         (1U)
#define FLEXPWM_CAPTCTRLA_INP_SELA(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLA_INP_SELA_SHIFT)) & FLEXPWM_CAPTCTRLA_INP_SELA_MASK)

#define FLEXPWM_CAPTCTRLA_EDGCNTA_EN_MASK        (0x80U)
#define FLEXPWM_CAPTCTRLA_EDGCNTA_EN_SHIFT       (7U)
#define FLEXPWM_CAPTCTRLA_EDGCNTA_EN_WIDTH       (1U)
#define FLEXPWM_CAPTCTRLA_EDGCNTA_EN(x)          (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLA_EDGCNTA_EN_SHIFT)) & FLEXPWM_CAPTCTRLA_EDGCNTA_EN_MASK)

#define FLEXPWM_CAPTCTRLA_CFAWM_MASK             (0x300U)
#define FLEXPWM_CAPTCTRLA_CFAWM_SHIFT            (8U)
#define FLEXPWM_CAPTCTRLA_CFAWM_WIDTH            (2U)
#define FLEXPWM_CAPTCTRLA_CFAWM(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLA_CFAWM_SHIFT)) & FLEXPWM_CAPTCTRLA_CFAWM_MASK)

#define FLEXPWM_CAPTCTRLA_CA0CNT_MASK            (0x1C00U)
#define FLEXPWM_CAPTCTRLA_CA0CNT_SHIFT           (10U)
#define FLEXPWM_CAPTCTRLA_CA0CNT_WIDTH           (3U)
#define FLEXPWM_CAPTCTRLA_CA0CNT(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLA_CA0CNT_SHIFT)) & FLEXPWM_CAPTCTRLA_CA0CNT_MASK)

#define FLEXPWM_CAPTCTRLA_CA1CNT_MASK            (0xE000U)
#define FLEXPWM_CAPTCTRLA_CA1CNT_SHIFT           (13U)
#define FLEXPWM_CAPTCTRLA_CA1CNT_WIDTH           (3U)
#define FLEXPWM_CAPTCTRLA_CA1CNT(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLA_CA1CNT_SHIFT)) & FLEXPWM_CAPTCTRLA_CA1CNT_MASK)
/*! @} */

/*! @name CAPTCOMPA - Submodule 0 Capture Compare A..Submodule 3 Capture Compare A */
/*! @{ */

#define FLEXPWM_CAPTCOMPA_EDGCMPA_MASK           (0xFFU)
#define FLEXPWM_CAPTCOMPA_EDGCMPA_SHIFT          (0U)
#define FLEXPWM_CAPTCOMPA_EDGCMPA_WIDTH          (8U)
#define FLEXPWM_CAPTCOMPA_EDGCMPA(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCOMPA_EDGCMPA_SHIFT)) & FLEXPWM_CAPTCOMPA_EDGCMPA_MASK)

#define FLEXPWM_CAPTCOMPA_EDGCNTA_MASK           (0xFF00U)
#define FLEXPWM_CAPTCOMPA_EDGCNTA_SHIFT          (8U)
#define FLEXPWM_CAPTCOMPA_EDGCNTA_WIDTH          (8U)
#define FLEXPWM_CAPTCOMPA_EDGCNTA(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCOMPA_EDGCNTA_SHIFT)) & FLEXPWM_CAPTCOMPA_EDGCNTA_MASK)
/*! @} */

/*! @name CAPTCTRLB - Submodule 0 Capture Control B..Submodule 3 Capture Control B */
/*! @{ */

#define FLEXPWM_CAPTCTRLB_ARMB_MASK              (0x1U)
#define FLEXPWM_CAPTCTRLB_ARMB_SHIFT             (0U)
#define FLEXPWM_CAPTCTRLB_ARMB_WIDTH             (1U)
#define FLEXPWM_CAPTCTRLB_ARMB(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLB_ARMB_SHIFT)) & FLEXPWM_CAPTCTRLB_ARMB_MASK)

