rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FLEXPWM.h
#define FLEXPWM_CAPTCTRLB_ONESHOTB_MASK          (0x2U)
#define FLEXPWM_CAPTCTRLB_ONESHOTB_SHIFT         (1U)
#define FLEXPWM_CAPTCTRLB_ONESHOTB_WIDTH         (1U)
#define FLEXPWM_CAPTCTRLB_ONESHOTB(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLB_ONESHOTB_SHIFT)) & FLEXPWM_CAPTCTRLB_ONESHOTB_MASK)

#define FLEXPWM_CAPTCTRLB_EDGB0_MASK             (0xCU)
#define FLEXPWM_CAPTCTRLB_EDGB0_SHIFT            (2U)
#define FLEXPWM_CAPTCTRLB_EDGB0_WIDTH            (2U)
#define FLEXPWM_CAPTCTRLB_EDGB0(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLB_EDGB0_SHIFT)) & FLEXPWM_CAPTCTRLB_EDGB0_MASK)

#define FLEXPWM_CAPTCTRLB_EDGB1_MASK             (0x30U)
#define FLEXPWM_CAPTCTRLB_EDGB1_SHIFT            (4U)
#define FLEXPWM_CAPTCTRLB_EDGB1_WIDTH            (2U)
#define FLEXPWM_CAPTCTRLB_EDGB1(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLB_EDGB1_SHIFT)) & FLEXPWM_CAPTCTRLB_EDGB1_MASK)

#define FLEXPWM_CAPTCTRLB_INP_SELB_MASK          (0x40U)
#define FLEXPWM_CAPTCTRLB_INP_SELB_SHIFT         (6U)
#define FLEXPWM_CAPTCTRLB_INP_SELB_WIDTH         (1U)
#define FLEXPWM_CAPTCTRLB_INP_SELB(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLB_INP_SELB_SHIFT)) & FLEXPWM_CAPTCTRLB_INP_SELB_MASK)

#define FLEXPWM_CAPTCTRLB_EDGCNTB_EN_MASK        (0x80U)
#define FLEXPWM_CAPTCTRLB_EDGCNTB_EN_SHIFT       (7U)
#define FLEXPWM_CAPTCTRLB_EDGCNTB_EN_WIDTH       (1U)
#define FLEXPWM_CAPTCTRLB_EDGCNTB_EN(x)          (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLB_EDGCNTB_EN_SHIFT)) & FLEXPWM_CAPTCTRLB_EDGCNTB_EN_MASK)

#define FLEXPWM_CAPTCTRLB_CFBWM_MASK             (0x300U)
#define FLEXPWM_CAPTCTRLB_CFBWM_SHIFT            (8U)
#define FLEXPWM_CAPTCTRLB_CFBWM_WIDTH            (2U)
#define FLEXPWM_CAPTCTRLB_CFBWM(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLB_CFBWM_SHIFT)) & FLEXPWM_CAPTCTRLB_CFBWM_MASK)

#define FLEXPWM_CAPTCTRLB_CB0CNT_MASK            (0x1C00U)
#define FLEXPWM_CAPTCTRLB_CB0CNT_SHIFT           (10U)
#define FLEXPWM_CAPTCTRLB_CB0CNT_WIDTH           (3U)
#define FLEXPWM_CAPTCTRLB_CB0CNT(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLB_CB0CNT_SHIFT)) & FLEXPWM_CAPTCTRLB_CB0CNT_MASK)

#define FLEXPWM_CAPTCTRLB_CB1CNT_MASK            (0xE000U)
#define FLEXPWM_CAPTCTRLB_CB1CNT_SHIFT           (13U)
#define FLEXPWM_CAPTCTRLB_CB1CNT_WIDTH           (3U)
#define FLEXPWM_CAPTCTRLB_CB1CNT(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLB_CB1CNT_SHIFT)) & FLEXPWM_CAPTCTRLB_CB1CNT_MASK)
/*! @} */

/*! @name CAPTCOMPB - Submodule 0 Capture Compare B..Submodule 3 Capture Compare B */
/*! @{ */

#define FLEXPWM_CAPTCOMPB_EDGCMPB_MASK           (0xFFU)
#define FLEXPWM_CAPTCOMPB_EDGCMPB_SHIFT          (0U)
#define FLEXPWM_CAPTCOMPB_EDGCMPB_WIDTH          (8U)
#define FLEXPWM_CAPTCOMPB_EDGCMPB(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCOMPB_EDGCMPB_SHIFT)) & FLEXPWM_CAPTCOMPB_EDGCMPB_MASK)

#define FLEXPWM_CAPTCOMPB_EDGCNTB_MASK           (0xFF00U)
#define FLEXPWM_CAPTCOMPB_EDGCNTB_SHIFT          (8U)
#define FLEXPWM_CAPTCOMPB_EDGCNTB_WIDTH          (8U)
#define FLEXPWM_CAPTCOMPB_EDGCNTB(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCOMPB_EDGCNTB_SHIFT)) & FLEXPWM_CAPTCOMPB_EDGCNTB_MASK)
/*! @} */

/*! @name CAPTCTRLX - Submodule 0 Capture Control X..Submodule 3 Capture Control X */
/*! @{ */

#define FLEXPWM_CAPTCTRLX_ARMX_MASK              (0x1U)
#define FLEXPWM_CAPTCTRLX_ARMX_SHIFT             (0U)
#define FLEXPWM_CAPTCTRLX_ARMX_WIDTH             (1U)
#define FLEXPWM_CAPTCTRLX_ARMX(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLX_ARMX_SHIFT)) & FLEXPWM_CAPTCTRLX_ARMX_MASK)

#define FLEXPWM_CAPTCTRLX_ONESHOTX_MASK          (0x2U)
#define FLEXPWM_CAPTCTRLX_ONESHOTX_SHIFT         (1U)
#define FLEXPWM_CAPTCTRLX_ONESHOTX_WIDTH         (1U)
#define FLEXPWM_CAPTCTRLX_ONESHOTX(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLX_ONESHOTX_SHIFT)) & FLEXPWM_CAPTCTRLX_ONESHOTX_MASK)

#define FLEXPWM_CAPTCTRLX_EDGX0_MASK             (0xCU)
#define FLEXPWM_CAPTCTRLX_EDGX0_SHIFT            (2U)
#define FLEXPWM_CAPTCTRLX_EDGX0_WIDTH            (2U)
#define FLEXPWM_CAPTCTRLX_EDGX0(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLX_EDGX0_SHIFT)) & FLEXPWM_CAPTCTRLX_EDGX0_MASK)

#define FLEXPWM_CAPTCTRLX_EDGX1_MASK             (0x30U)
#define FLEXPWM_CAPTCTRLX_EDGX1_SHIFT            (4U)
#define FLEXPWM_CAPTCTRLX_EDGX1_WIDTH            (2U)
#define FLEXPWM_CAPTCTRLX_EDGX1(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLX_EDGX1_SHIFT)) & FLEXPWM_CAPTCTRLX_EDGX1_MASK)

#define FLEXPWM_CAPTCTRLX_INP_SELX_MASK          (0x40U)
#define FLEXPWM_CAPTCTRLX_INP_SELX_SHIFT         (6U)
#define FLEXPWM_CAPTCTRLX_INP_SELX_WIDTH         (1U)
#define FLEXPWM_CAPTCTRLX_INP_SELX(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLX_INP_SELX_SHIFT)) & FLEXPWM_CAPTCTRLX_INP_SELX_MASK)

#define FLEXPWM_CAPTCTRLX_EDGCNTX_EN_MASK        (0x80U)
#define FLEXPWM_CAPTCTRLX_EDGCNTX_EN_SHIFT       (7U)
#define FLEXPWM_CAPTCTRLX_EDGCNTX_EN_WIDTH       (1U)
#define FLEXPWM_CAPTCTRLX_EDGCNTX_EN(x)          (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLX_EDGCNTX_EN_SHIFT)) & FLEXPWM_CAPTCTRLX_EDGCNTX_EN_MASK)

#define FLEXPWM_CAPTCTRLX_CFXWM_MASK             (0x300U)
#define FLEXPWM_CAPTCTRLX_CFXWM_SHIFT            (8U)
#define FLEXPWM_CAPTCTRLX_CFXWM_WIDTH            (2U)
#define FLEXPWM_CAPTCTRLX_CFXWM(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLX_CFXWM_SHIFT)) & FLEXPWM_CAPTCTRLX_CFXWM_MASK)

#define FLEXPWM_CAPTCTRLX_CX0CNT_MASK            (0x1C00U)
#define FLEXPWM_CAPTCTRLX_CX0CNT_SHIFT           (10U)
#define FLEXPWM_CAPTCTRLX_CX0CNT_WIDTH           (3U)
#define FLEXPWM_CAPTCTRLX_CX0CNT(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLX_CX0CNT_SHIFT)) & FLEXPWM_CAPTCTRLX_CX0CNT_MASK)

#define FLEXPWM_CAPTCTRLX_CX1CNT_MASK            (0xE000U)
#define FLEXPWM_CAPTCTRLX_CX1CNT_SHIFT           (13U)
#define FLEXPWM_CAPTCTRLX_CX1CNT_WIDTH           (3U)
#define FLEXPWM_CAPTCTRLX_CX1CNT(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCTRLX_CX1CNT_SHIFT)) & FLEXPWM_CAPTCTRLX_CX1CNT_MASK)
/*! @} */

