rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FLEXPWM.h
/*! @name CAPTCOMPX - Submodule 0 Capture Compare X..Submodule 3 Capture Compare X */
/*! @{ */

#define FLEXPWM_CAPTCOMPX_EDGCMPX_MASK           (0xFFU)
#define FLEXPWM_CAPTCOMPX_EDGCMPX_SHIFT          (0U)
#define FLEXPWM_CAPTCOMPX_EDGCMPX_WIDTH          (8U)
#define FLEXPWM_CAPTCOMPX_EDGCMPX(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCOMPX_EDGCMPX_SHIFT)) & FLEXPWM_CAPTCOMPX_EDGCMPX_MASK)

#define FLEXPWM_CAPTCOMPX_EDGCNTX_MASK           (0xFF00U)
#define FLEXPWM_CAPTCOMPX_EDGCNTX_SHIFT          (8U)
#define FLEXPWM_CAPTCOMPX_EDGCNTX_WIDTH          (8U)
#define FLEXPWM_CAPTCOMPX_EDGCNTX(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CAPTCOMPX_EDGCNTX_SHIFT)) & FLEXPWM_CAPTCOMPX_EDGCNTX_MASK)
/*! @} */

/*! @name CVAL0 - Submodule 0 Capture Value 0..Submodule 3 Capture Value 0 */
/*! @{ */

#define FLEXPWM_CVAL0_CAPTVAL0_MASK              (0xFFFFU)
#define FLEXPWM_CVAL0_CAPTVAL0_SHIFT             (0U)
#define FLEXPWM_CVAL0_CAPTVAL0_WIDTH             (16U)
#define FLEXPWM_CVAL0_CAPTVAL0(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL0_CAPTVAL0_SHIFT)) & FLEXPWM_CVAL0_CAPTVAL0_MASK)
/*! @} */

/*! @name CVAL0CYC - Submodule 0 Capture Value 0 Cycle..Submodule 3 Capture Value 0 Cycle */
/*! @{ */

#define FLEXPWM_CVAL0CYC_CVAL0CYC_MASK           (0xFU)
#define FLEXPWM_CVAL0CYC_CVAL0CYC_SHIFT          (0U)
#define FLEXPWM_CVAL0CYC_CVAL0CYC_WIDTH          (4U)
#define FLEXPWM_CVAL0CYC_CVAL0CYC(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL0CYC_CVAL0CYC_SHIFT)) & FLEXPWM_CVAL0CYC_CVAL0CYC_MASK)
/*! @} */

/*! @name CVAL1 - Submodule 0 Capture Value 1..Submodule 3 Capture Value 1 */
/*! @{ */

#define FLEXPWM_CVAL1_CAPTVAL1_MASK              (0xFFFFU)
#define FLEXPWM_CVAL1_CAPTVAL1_SHIFT             (0U)
#define FLEXPWM_CVAL1_CAPTVAL1_WIDTH             (16U)
#define FLEXPWM_CVAL1_CAPTVAL1(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL1_CAPTVAL1_SHIFT)) & FLEXPWM_CVAL1_CAPTVAL1_MASK)
/*! @} */

/*! @name CVAL1CYC - Submodule 0 Capture Value 1 Cycle..Submodule 3 Capture Value 1 Cycle */
/*! @{ */

#define FLEXPWM_CVAL1CYC_CVAL1CYC_MASK           (0xFU)
#define FLEXPWM_CVAL1CYC_CVAL1CYC_SHIFT          (0U)
#define FLEXPWM_CVAL1CYC_CVAL1CYC_WIDTH          (4U)
#define FLEXPWM_CVAL1CYC_CVAL1CYC(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL1CYC_CVAL1CYC_SHIFT)) & FLEXPWM_CVAL1CYC_CVAL1CYC_MASK)
/*! @} */

/*! @name CVAL2 - Submodule 0 Capture Value 2..Submodule 3 Capture Value 2 */
/*! @{ */

#define FLEXPWM_CVAL2_CAPTVAL2_MASK              (0xFFFFU)
#define FLEXPWM_CVAL2_CAPTVAL2_SHIFT             (0U)
#define FLEXPWM_CVAL2_CAPTVAL2_WIDTH             (16U)
#define FLEXPWM_CVAL2_CAPTVAL2(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL2_CAPTVAL2_SHIFT)) & FLEXPWM_CVAL2_CAPTVAL2_MASK)
/*! @} */

/*! @name CVAL2CYC - Submodule 0 Capture Value 2 Cycle..Submodule 3 Capture Value 2 Cycle */
/*! @{ */

#define FLEXPWM_CVAL2CYC_CVAL2CYC_MASK           (0xFU)
#define FLEXPWM_CVAL2CYC_CVAL2CYC_SHIFT          (0U)
#define FLEXPWM_CVAL2CYC_CVAL2CYC_WIDTH          (4U)
#define FLEXPWM_CVAL2CYC_CVAL2CYC(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL2CYC_CVAL2CYC_SHIFT)) & FLEXPWM_CVAL2CYC_CVAL2CYC_MASK)
/*! @} */

/*! @name CVAL3 - Submodule 0 Capture Value 3..Submodule 3 Capture Value 3 */
/*! @{ */

#define FLEXPWM_CVAL3_CAPTVAL3_MASK              (0xFFFFU)
#define FLEXPWM_CVAL3_CAPTVAL3_SHIFT             (0U)
#define FLEXPWM_CVAL3_CAPTVAL3_WIDTH             (16U)
#define FLEXPWM_CVAL3_CAPTVAL3(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL3_CAPTVAL3_SHIFT)) & FLEXPWM_CVAL3_CAPTVAL3_MASK)
/*! @} */

/*! @name CVAL3CYC - Submodule 0 Capture Value 3 Cycle..Submodule 3 Capture Value 3 Cycle */
/*! @{ */

#define FLEXPWM_CVAL3CYC_CVAL3CYC_MASK           (0xFU)
#define FLEXPWM_CVAL3CYC_CVAL3CYC_SHIFT          (0U)
#define FLEXPWM_CVAL3CYC_CVAL3CYC_WIDTH          (4U)
#define FLEXPWM_CVAL3CYC_CVAL3CYC(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL3CYC_CVAL3CYC_SHIFT)) & FLEXPWM_CVAL3CYC_CVAL3CYC_MASK)
/*! @} */

/*! @name CVAL4 - Submodule 0 Capture Value 4..Submodule 3 Capture Value 4 */
/*! @{ */

#define FLEXPWM_CVAL4_CAPTVAL4_MASK              (0xFFFFU)
#define FLEXPWM_CVAL4_CAPTVAL4_SHIFT             (0U)
#define FLEXPWM_CVAL4_CAPTVAL4_WIDTH             (16U)
#define FLEXPWM_CVAL4_CAPTVAL4(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL4_CAPTVAL4_SHIFT)) & FLEXPWM_CVAL4_CAPTVAL4_MASK)
/*! @} */

/*! @name CVAL4CYC - Submodule 0 Capture Value 4 Cycle..Submodule 3 Capture Value 4 Cycle */
/*! @{ */

#define FLEXPWM_CVAL4CYC_CVAL4CYC_MASK           (0xFU)
#define FLEXPWM_CVAL4CYC_CVAL4CYC_SHIFT          (0U)
#define FLEXPWM_CVAL4CYC_CVAL4CYC_WIDTH          (4U)
#define FLEXPWM_CVAL4CYC_CVAL4CYC(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL4CYC_CVAL4CYC_SHIFT)) & FLEXPWM_CVAL4CYC_CVAL4CYC_MASK)
/*! @} */

/*! @name CVAL5 - Submodule 0 Capture Value 5..Submodule 3 Capture Value 5 */
/*! @{ */

#define FLEXPWM_CVAL5_CAPTVAL5_MASK              (0xFFFFU)
#define FLEXPWM_CVAL5_CAPTVAL5_SHIFT             (0U)
#define FLEXPWM_CVAL5_CAPTVAL5_WIDTH             (16U)
#define FLEXPWM_CVAL5_CAPTVAL5(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL5_CAPTVAL5_SHIFT)) & FLEXPWM_CVAL5_CAPTVAL5_MASK)
/*! @} */

/*! @name CVAL5CYC - Submodule 0 Capture Value 5 Cycle..Submodule 3 Capture Value 5 Cycle */
/*! @{ */

#define FLEXPWM_CVAL5CYC_CVAL5CYC_MASK           (0xFU)
#define FLEXPWM_CVAL5CYC_CVAL5CYC_SHIFT          (0U)
#define FLEXPWM_CVAL5CYC_CVAL5CYC_WIDTH          (4U)
#define FLEXPWM_CVAL5CYC_CVAL5CYC(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CVAL5CYC_CVAL5CYC_SHIFT)) & FLEXPWM_CVAL5CYC_CVAL5CYC_MASK)
/*! @} */

/*! @name PHASEDLY - Submodule 1 Phase Delay..Submodule 3 Phase Delay */
/*! @{ */

#define FLEXPWM_PHASEDLY_PHASEDLY_MASK           (0xFFFFU)
#define FLEXPWM_PHASEDLY_PHASEDLY_SHIFT          (0U)
#define FLEXPWM_PHASEDLY_PHASEDLY_WIDTH          (16U)
#define FLEXPWM_PHASEDLY_PHASEDLY(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_PHASEDLY_PHASEDLY_SHIFT)) & FLEXPWM_PHASEDLY_PHASEDLY_MASK)
/*! @} */

/*! @name OUTEN - Output Enable */
/*! @{ */

