rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FLEXPWM.h
#define FLEXPWM_MCTRL_CLDOK_MASK                 (0xF0U)
#define FLEXPWM_MCTRL_CLDOK_SHIFT                (4U)
#define FLEXPWM_MCTRL_CLDOK_WIDTH                (4U)
#define FLEXPWM_MCTRL_CLDOK(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MCTRL_CLDOK_SHIFT)) & FLEXPWM_MCTRL_CLDOK_MASK)

#define FLEXPWM_MCTRL_RUN_MASK                   (0xF00U)
#define FLEXPWM_MCTRL_RUN_SHIFT                  (8U)
#define FLEXPWM_MCTRL_RUN_WIDTH                  (4U)
#define FLEXPWM_MCTRL_RUN(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MCTRL_RUN_SHIFT)) & FLEXPWM_MCTRL_RUN_MASK)

#define FLEXPWM_MCTRL_IPOL_MASK                  (0xF000U)
#define FLEXPWM_MCTRL_IPOL_SHIFT                 (12U)
#define FLEXPWM_MCTRL_IPOL_WIDTH                 (4U)
#define FLEXPWM_MCTRL_IPOL(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MCTRL_IPOL_SHIFT)) & FLEXPWM_MCTRL_IPOL_MASK)
/*! @} */

/*! @name MCTRL2 - Master Control 2 */
/*! @{ */

#define FLEXPWM_MCTRL2_MONPLL_MASK               (0x3U)
#define FLEXPWM_MCTRL2_MONPLL_SHIFT              (0U)
#define FLEXPWM_MCTRL2_MONPLL_WIDTH              (2U)
#define FLEXPWM_MCTRL2_MONPLL(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MCTRL2_MONPLL_SHIFT)) & FLEXPWM_MCTRL2_MONPLL_MASK)
/*! @} */

/*! @name CTRL - Fault Protection 0 Control */
/*! @{ */

#define FLEXPWM_CTRL_FIE_MASK                    (0xFU)
#define FLEXPWM_CTRL_FIE_SHIFT                   (0U)
#define FLEXPWM_CTRL_FIE_WIDTH                   (4U)
#define FLEXPWM_CTRL_FIE(x)                      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_FIE_SHIFT)) & FLEXPWM_CTRL_FIE_MASK)

#define FLEXPWM_CTRL_FSAFE_MASK                  (0xF0U)
#define FLEXPWM_CTRL_FSAFE_SHIFT                 (4U)
#define FLEXPWM_CTRL_FSAFE_WIDTH                 (4U)
#define FLEXPWM_CTRL_FSAFE(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_FSAFE_SHIFT)) & FLEXPWM_CTRL_FSAFE_MASK)

#define FLEXPWM_CTRL_FAUTO_MASK                  (0xF00U)
#define FLEXPWM_CTRL_FAUTO_SHIFT                 (8U)
#define FLEXPWM_CTRL_FAUTO_WIDTH                 (4U)
#define FLEXPWM_CTRL_FAUTO(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_FAUTO_SHIFT)) & FLEXPWM_CTRL_FAUTO_MASK)

#define FLEXPWM_CTRL_FLVL_MASK                   (0xF000U)
#define FLEXPWM_CTRL_FLVL_SHIFT                  (12U)
#define FLEXPWM_CTRL_FLVL_WIDTH                  (4U)
#define FLEXPWM_CTRL_FLVL(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL_FLVL_SHIFT)) & FLEXPWM_CTRL_FLVL_MASK)
/*! @} */

/*! @name STS - Fault Protection 0 Status */
/*! @{ */

#define FLEXPWM_STS_FFLAG_MASK                   (0xFU)
#define FLEXPWM_STS_FFLAG_SHIFT                  (0U)
#define FLEXPWM_STS_FFLAG_WIDTH                  (4U)
#define FLEXPWM_STS_FFLAG(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_FFLAG_SHIFT)) & FLEXPWM_STS_FFLAG_MASK)

#define FLEXPWM_STS_FFULL_MASK                   (0xF0U)
#define FLEXPWM_STS_FFULL_SHIFT                  (4U)
#define FLEXPWM_STS_FFULL_WIDTH                  (4U)
#define FLEXPWM_STS_FFULL(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_FFULL_SHIFT)) & FLEXPWM_STS_FFULL_MASK)

#define FLEXPWM_STS_FFPIN_MASK                   (0xF00U)
#define FLEXPWM_STS_FFPIN_SHIFT                  (8U)
#define FLEXPWM_STS_FFPIN_WIDTH                  (4U)
#define FLEXPWM_STS_FFPIN(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_FFPIN_SHIFT)) & FLEXPWM_STS_FFPIN_MASK)

#define FLEXPWM_STS_FHALF_MASK                   (0xF000U)
#define FLEXPWM_STS_FHALF_SHIFT                  (12U)
#define FLEXPWM_STS_FHALF_WIDTH                  (4U)
#define FLEXPWM_STS_FHALF(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_STS_FHALF_SHIFT)) & FLEXPWM_STS_FHALF_MASK)
/*! @} */

/*! @name FILT - Fault Protection 0 Filter */
/*! @{ */

#define FLEXPWM_FILT_FILT_PER_MASK               (0xFFU)
#define FLEXPWM_FILT_FILT_PER_SHIFT              (0U)
#define FLEXPWM_FILT_FILT_PER_WIDTH              (8U)
#define FLEXPWM_FILT_FILT_PER(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FILT_FILT_PER_SHIFT)) & FLEXPWM_FILT_FILT_PER_MASK)

#define FLEXPWM_FILT_FILT_CNT_MASK               (0x700U)
#define FLEXPWM_FILT_FILT_CNT_SHIFT              (8U)
#define FLEXPWM_FILT_FILT_CNT_WIDTH              (3U)
#define FLEXPWM_FILT_FILT_CNT(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FILT_FILT_CNT_SHIFT)) & FLEXPWM_FILT_FILT_CNT_MASK)

#define FLEXPWM_FILT_GSTR_MASK                   (0x8000U)
#define FLEXPWM_FILT_GSTR_SHIFT                  (15U)
#define FLEXPWM_FILT_GSTR_WIDTH                  (1U)
#define FLEXPWM_FILT_GSTR(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FILT_GSTR_SHIFT)) & FLEXPWM_FILT_GSTR_MASK)
/*! @} */

/*! @name TST - Fault Protection 0 Test */
/*! @{ */

#define FLEXPWM_TST_FTEST_MASK                   (0x1U)
#define FLEXPWM_TST_FTEST_SHIFT                  (0U)
#define FLEXPWM_TST_FTEST_WIDTH                  (1U)
#define FLEXPWM_TST_FTEST(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_TST_FTEST_SHIFT)) & FLEXPWM_TST_FTEST_MASK)
/*! @} */

/*! @name CTRL2 - Fault Protection 0 Control 2 */
/*! @{ */

#define FLEXPWM_CTRL2_NOCOMB_MASK                (0xFU)
#define FLEXPWM_CTRL2_NOCOMB_SHIFT               (0U)
#define FLEXPWM_CTRL2_NOCOMB_WIDTH               (4U)
#define FLEXPWM_CTRL2_NOCOMB(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_CTRL2_NOCOMB_SHIFT)) & FLEXPWM_CTRL2_NOCOMB_MASK)
/*! @} */

/*! @name DLLSR - DLL Status */
/*! @{ */

#define FLEXPWM_DLLSR_LOCK_MASK                  (0x1U)
#define FLEXPWM_DLLSR_LOCK_SHIFT                 (0U)
#define FLEXPWM_DLLSR_LOCK_WIDTH                 (1U)
#define FLEXPWM_DLLSR_LOCK(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DLLSR_LOCK_SHIFT)) & FLEXPWM_DLLSR_LOCK_MASK)

#define FLEXPWM_DLLSR_LOL_MASK                   (0x2U)
#define FLEXPWM_DLLSR_LOL_SHIFT                  (1U)
#define FLEXPWM_DLLSR_LOL_WIDTH                  (1U)
#define FLEXPWM_DLLSR_LOL(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DLLSR_LOL_SHIFT)) & FLEXPWM_DLLSR_LOL_MASK)
/*! @} */

