rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FLEXPWM.h
#define FLEXPWM_SM2_BIST_CTRL_COUNTER_THRESHOLD_MASK (0xE000U)
#define FLEXPWM_SM2_BIST_CTRL_COUNTER_THRESHOLD_SHIFT (13U)
#define FLEXPWM_SM2_BIST_CTRL_COUNTER_THRESHOLD_WIDTH (3U)
#define FLEXPWM_SM2_BIST_CTRL_COUNTER_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2_BIST_CTRL_COUNTER_THRESHOLD_SHIFT)) & FLEXPWM_SM2_BIST_CTRL_COUNTER_THRESHOLD_MASK)
/*! @} */

/*! @name SM2_BIST_CTRL1 - Submodule 2 BIST Control */
/*! @{ */

#define FLEXPWM_SM2_BIST_CTRL1_DATA_INITIAL_MASK (0x1FU)
#define FLEXPWM_SM2_BIST_CTRL1_DATA_INITIAL_SHIFT (0U)
#define FLEXPWM_SM2_BIST_CTRL1_DATA_INITIAL_WIDTH (5U)
#define FLEXPWM_SM2_BIST_CTRL1_DATA_INITIAL(x)   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2_BIST_CTRL1_DATA_INITIAL_SHIFT)) & FLEXPWM_SM2_BIST_CTRL1_DATA_INITIAL_MASK)

#define FLEXPWM_SM2_BIST_CTRL1_DATA_FINAL_MASK   (0x1F00U)
#define FLEXPWM_SM2_BIST_CTRL1_DATA_FINAL_SHIFT  (8U)
#define FLEXPWM_SM2_BIST_CTRL1_DATA_FINAL_WIDTH  (5U)
#define FLEXPWM_SM2_BIST_CTRL1_DATA_FINAL(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2_BIST_CTRL1_DATA_FINAL_SHIFT)) & FLEXPWM_SM2_BIST_CTRL1_DATA_FINAL_MASK)
/*! @} */

/*! @name SM3_BIST_CTRL - Submodule 3 BIST Control */
/*! @{ */

#define FLEXPWM_SM3_BIST_CTRL_BIST_ENABLE_MASK   (0x1U)
#define FLEXPWM_SM3_BIST_CTRL_BIST_ENABLE_SHIFT  (0U)
#define FLEXPWM_SM3_BIST_CTRL_BIST_ENABLE_WIDTH  (1U)
#define FLEXPWM_SM3_BIST_CTRL_BIST_ENABLE(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_CTRL_BIST_ENABLE_SHIFT)) & FLEXPWM_SM3_BIST_CTRL_BIST_ENABLE_MASK)

#define FLEXPWM_SM3_BIST_CTRL_CLK_INITIAL_MASK   (0x3EU)
#define FLEXPWM_SM3_BIST_CTRL_CLK_INITIAL_SHIFT  (1U)
#define FLEXPWM_SM3_BIST_CTRL_CLK_INITIAL_WIDTH  (5U)
#define FLEXPWM_SM3_BIST_CTRL_CLK_INITIAL(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_CTRL_CLK_INITIAL_SHIFT)) & FLEXPWM_SM3_BIST_CTRL_CLK_INITIAL_MASK)

#define FLEXPWM_SM3_BIST_CTRL_TOGGLE_MODE_MASK   (0x40U)
#define FLEXPWM_SM3_BIST_CTRL_TOGGLE_MODE_SHIFT  (6U)
#define FLEXPWM_SM3_BIST_CTRL_TOGGLE_MODE_WIDTH  (1U)
#define FLEXPWM_SM3_BIST_CTRL_TOGGLE_MODE(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_CTRL_TOGGLE_MODE_SHIFT)) & FLEXPWM_SM3_BIST_CTRL_TOGGLE_MODE_MASK)

#define FLEXPWM_SM3_BIST_CTRL_MANUAL_TOGGLE_MASK (0x80U)
#define FLEXPWM_SM3_BIST_CTRL_MANUAL_TOGGLE_SHIFT (7U)
#define FLEXPWM_SM3_BIST_CTRL_MANUAL_TOGGLE_WIDTH (1U)
#define FLEXPWM_SM3_BIST_CTRL_MANUAL_TOGGLE(x)   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_CTRL_MANUAL_TOGGLE_SHIFT)) & FLEXPWM_SM3_BIST_CTRL_MANUAL_TOGGLE_MASK)

#define FLEXPWM_SM3_BIST_CTRL_CLK_FINAL_MASK     (0x1F00U)
#define FLEXPWM_SM3_BIST_CTRL_CLK_FINAL_SHIFT    (8U)
#define FLEXPWM_SM3_BIST_CTRL_CLK_FINAL_WIDTH    (5U)
#define FLEXPWM_SM3_BIST_CTRL_CLK_FINAL(x)       (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_CTRL_CLK_FINAL_SHIFT)) & FLEXPWM_SM3_BIST_CTRL_CLK_FINAL_MASK)

#define FLEXPWM_SM3_BIST_CTRL_COUNTER_THRESHOLD_MASK (0xE000U)
#define FLEXPWM_SM3_BIST_CTRL_COUNTER_THRESHOLD_SHIFT (13U)
#define FLEXPWM_SM3_BIST_CTRL_COUNTER_THRESHOLD_WIDTH (3U)
#define FLEXPWM_SM3_BIST_CTRL_COUNTER_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_CTRL_COUNTER_THRESHOLD_SHIFT)) & FLEXPWM_SM3_BIST_CTRL_COUNTER_THRESHOLD_MASK)
/*! @} */

/*! @name SM3_BIST_CTRL1 - Submodule 3 BIST Control */
/*! @{ */

#define FLEXPWM_SM3_BIST_CTRL1_DATA_INITIAL_MASK (0x1FU)
#define FLEXPWM_SM3_BIST_CTRL1_DATA_INITIAL_SHIFT (0U)
#define FLEXPWM_SM3_BIST_CTRL1_DATA_INITIAL_WIDTH (5U)
#define FLEXPWM_SM3_BIST_CTRL1_DATA_INITIAL(x)   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_CTRL1_DATA_INITIAL_SHIFT)) & FLEXPWM_SM3_BIST_CTRL1_DATA_INITIAL_MASK)

#define FLEXPWM_SM3_BIST_CTRL1_DATA_FINAL_MASK   (0x1F00U)
#define FLEXPWM_SM3_BIST_CTRL1_DATA_FINAL_SHIFT  (8U)
#define FLEXPWM_SM3_BIST_CTRL1_DATA_FINAL_WIDTH  (5U)
#define FLEXPWM_SM3_BIST_CTRL1_DATA_FINAL(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_CTRL1_DATA_FINAL_SHIFT)) & FLEXPWM_SM3_BIST_CTRL1_DATA_FINAL_MASK)
/*! @} */

/*! @name SM0_BIST_STATUS - Submodule 0 BIST Status */
/*! @{ */

#define FLEXPWM_SM0_BIST_STATUS_BIST_DONE_MASK   (0x1U)
#define FLEXPWM_SM0_BIST_STATUS_BIST_DONE_SHIFT  (0U)
#define FLEXPWM_SM0_BIST_STATUS_BIST_DONE_WIDTH  (1U)
#define FLEXPWM_SM0_BIST_STATUS_BIST_DONE(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0_BIST_STATUS_BIST_DONE_SHIFT)) & FLEXPWM_SM0_BIST_STATUS_BIST_DONE_MASK)

#define FLEXPWM_SM0_BIST_STATUS_BIST_PASS_MASK   (0x2U)
#define FLEXPWM_SM0_BIST_STATUS_BIST_PASS_SHIFT  (1U)
#define FLEXPWM_SM0_BIST_STATUS_BIST_PASS_WIDTH  (1U)
#define FLEXPWM_SM0_BIST_STATUS_BIST_PASS(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0_BIST_STATUS_BIST_PASS_SHIFT)) & FLEXPWM_SM0_BIST_STATUS_BIST_PASS_MASK)

#define FLEXPWM_SM0_BIST_STATUS_FAIL_CLK_MASK    (0x1F00U)
#define FLEXPWM_SM0_BIST_STATUS_FAIL_CLK_SHIFT   (8U)
#define FLEXPWM_SM0_BIST_STATUS_FAIL_CLK_WIDTH   (5U)
#define FLEXPWM_SM0_BIST_STATUS_FAIL_CLK(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0_BIST_STATUS_FAIL_CLK_SHIFT)) & FLEXPWM_SM0_BIST_STATUS_FAIL_CLK_MASK)
/*! @} */

/*! @name SM0_BIST_STATUS1 - Submodule 0 BIST Status */
/*! @{ */

#define FLEXPWM_SM0_BIST_STATUS1_FAIL_DATA_MASK  (0x1FU)
#define FLEXPWM_SM0_BIST_STATUS1_FAIL_DATA_SHIFT (0U)
#define FLEXPWM_SM0_BIST_STATUS1_FAIL_DATA_WIDTH (5U)
#define FLEXPWM_SM0_BIST_STATUS1_FAIL_DATA(x)    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0_BIST_STATUS1_FAIL_DATA_SHIFT)) & FLEXPWM_SM0_BIST_STATUS1_FAIL_DATA_MASK)
/*! @} */

/*! @name SM1_BIST_STATUS - Submodule 1 BIST Status */
/*! @{ */

#define FLEXPWM_SM1_BIST_STATUS_BIST_DONE_MASK   (0x1U)
#define FLEXPWM_SM1_BIST_STATUS_BIST_DONE_SHIFT  (0U)
#define FLEXPWM_SM1_BIST_STATUS_BIST_DONE_WIDTH  (1U)
#define FLEXPWM_SM1_BIST_STATUS_BIST_DONE(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1_BIST_STATUS_BIST_DONE_SHIFT)) & FLEXPWM_SM1_BIST_STATUS_BIST_DONE_MASK)

#define FLEXPWM_SM1_BIST_STATUS_BIST_PASS_MASK   (0x2U)
#define FLEXPWM_SM1_BIST_STATUS_BIST_PASS_SHIFT  (1U)
#define FLEXPWM_SM1_BIST_STATUS_BIST_PASS_WIDTH  (1U)
#define FLEXPWM_SM1_BIST_STATUS_BIST_PASS(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1_BIST_STATUS_BIST_PASS_SHIFT)) & FLEXPWM_SM1_BIST_STATUS_BIST_PASS_MASK)

#define FLEXPWM_SM1_BIST_STATUS_FAIL_CLK_MASK    (0x1F00U)
#define FLEXPWM_SM1_BIST_STATUS_FAIL_CLK_SHIFT   (8U)
#define FLEXPWM_SM1_BIST_STATUS_FAIL_CLK_WIDTH   (5U)
#define FLEXPWM_SM1_BIST_STATUS_FAIL_CLK(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1_BIST_STATUS_FAIL_CLK_SHIFT)) & FLEXPWM_SM1_BIST_STATUS_FAIL_CLK_MASK)
/*! @} */

/*! @name SM1_BIST_STATUS1 - Submodule 1 BIST Status */
/*! @{ */

#define FLEXPWM_SM1_BIST_STATUS1_FAIL_DATA_MASK  (0x1FU)
#define FLEXPWM_SM1_BIST_STATUS1_FAIL_DATA_SHIFT (0U)
#define FLEXPWM_SM1_BIST_STATUS1_FAIL_DATA_WIDTH (5U)
#define FLEXPWM_SM1_BIST_STATUS1_FAIL_DATA(x)    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1_BIST_STATUS1_FAIL_DATA_SHIFT)) & FLEXPWM_SM1_BIST_STATUS1_FAIL_DATA_MASK)
/*! @} */

/*! @name SM2_BIST_STATUS - Submodule 2 BIST Status */
/*! @{ */

#define FLEXPWM_SM2_BIST_STATUS_BIST_DONE_MASK   (0x1U)
#define FLEXPWM_SM2_BIST_STATUS_BIST_DONE_SHIFT  (0U)
#define FLEXPWM_SM2_BIST_STATUS_BIST_DONE_WIDTH  (1U)
#define FLEXPWM_SM2_BIST_STATUS_BIST_DONE(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2_BIST_STATUS_BIST_DONE_SHIFT)) & FLEXPWM_SM2_BIST_STATUS_BIST_DONE_MASK)

#define FLEXPWM_SM2_BIST_STATUS_BIST_PASS_MASK   (0x2U)
#define FLEXPWM_SM2_BIST_STATUS_BIST_PASS_SHIFT  (1U)
#define FLEXPWM_SM2_BIST_STATUS_BIST_PASS_WIDTH  (1U)
#define FLEXPWM_SM2_BIST_STATUS_BIST_PASS(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2_BIST_STATUS_BIST_PASS_SHIFT)) & FLEXPWM_SM2_BIST_STATUS_BIST_PASS_MASK)

#define FLEXPWM_SM2_BIST_STATUS_FAIL_CLK_MASK    (0x1F00U)
#define FLEXPWM_SM2_BIST_STATUS_FAIL_CLK_SHIFT   (8U)
#define FLEXPWM_SM2_BIST_STATUS_FAIL_CLK_WIDTH   (5U)
#define FLEXPWM_SM2_BIST_STATUS_FAIL_CLK(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2_BIST_STATUS_FAIL_CLK_SHIFT)) & FLEXPWM_SM2_BIST_STATUS_FAIL_CLK_MASK)
/*! @} */

