rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FLEXPWM.h
/*! @name SM2_BIST_STATUS1 - Submodule 2 BIST Status */
/*! @{ */

#define FLEXPWM_SM2_BIST_STATUS1_FAIL_DATA_MASK  (0x1FU)
#define FLEXPWM_SM2_BIST_STATUS1_FAIL_DATA_SHIFT (0U)
#define FLEXPWM_SM2_BIST_STATUS1_FAIL_DATA_WIDTH (5U)
#define FLEXPWM_SM2_BIST_STATUS1_FAIL_DATA(x)    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2_BIST_STATUS1_FAIL_DATA_SHIFT)) & FLEXPWM_SM2_BIST_STATUS1_FAIL_DATA_MASK)
/*! @} */

/*! @name SM3_BIST_STATUS - Submodule 3 BIST Status */
/*! @{ */

#define FLEXPWM_SM3_BIST_STATUS_BIST_DONE_MASK   (0x1U)
#define FLEXPWM_SM3_BIST_STATUS_BIST_DONE_SHIFT  (0U)
#define FLEXPWM_SM3_BIST_STATUS_BIST_DONE_WIDTH  (1U)
#define FLEXPWM_SM3_BIST_STATUS_BIST_DONE(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_STATUS_BIST_DONE_SHIFT)) & FLEXPWM_SM3_BIST_STATUS_BIST_DONE_MASK)

#define FLEXPWM_SM3_BIST_STATUS_BIST_PASS_MASK   (0x2U)
#define FLEXPWM_SM3_BIST_STATUS_BIST_PASS_SHIFT  (1U)
#define FLEXPWM_SM3_BIST_STATUS_BIST_PASS_WIDTH  (1U)
#define FLEXPWM_SM3_BIST_STATUS_BIST_PASS(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_STATUS_BIST_PASS_SHIFT)) & FLEXPWM_SM3_BIST_STATUS_BIST_PASS_MASK)

#define FLEXPWM_SM3_BIST_STATUS_FAIL_CLK_MASK    (0x1F00U)
#define FLEXPWM_SM3_BIST_STATUS_FAIL_CLK_SHIFT   (8U)
#define FLEXPWM_SM3_BIST_STATUS_FAIL_CLK_WIDTH   (5U)
#define FLEXPWM_SM3_BIST_STATUS_FAIL_CLK(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_STATUS_FAIL_CLK_SHIFT)) & FLEXPWM_SM3_BIST_STATUS_FAIL_CLK_MASK)
/*! @} */

/*! @name SM3_BIST_STATUS1 - Submodule 3 BIST Status */
/*! @{ */

#define FLEXPWM_SM3_BIST_STATUS1_FAIL_DATA_MASK  (0x1FU)
#define FLEXPWM_SM3_BIST_STATUS1_FAIL_DATA_SHIFT (0U)
#define FLEXPWM_SM3_BIST_STATUS1_FAIL_DATA_WIDTH (5U)
#define FLEXPWM_SM3_BIST_STATUS1_FAIL_DATA(x)    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3_BIST_STATUS1_FAIL_DATA_SHIFT)) & FLEXPWM_SM3_BIST_STATUS1_FAIL_DATA_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group FLEXPWM_Register_Masks */

/*!
 * @}
 */ /* end of group FLEXPWM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K37_FLEXPWM_H_) */
